[
  {
    "id": 77340,
    "name": "Amsterdam",
    "state_id": 2612,
    "state_code": "NH",
    "state_name": "North Holland",
    "country_id": 156,
    "country_code": "NL",
    "country_name": "Netherlands",
    "latitude": "52.37403000",
    "longitude": "4.88969000",
    "wikiDataId": "Q727",
    "about": "Amsterdam, city and port, western Netherlands, located on the IJsselmeer and connected to the North Sea. It is the capital and the principal commercial and financial centre of the Netherlands. To the scores of tourists who visit each year, Amsterdam is known for its historical attractions, for its collections of great art, and for the distinctive colour and flavour of its old sections, which have been so well preserved. However, visitors to the city also see a crowded metropolis beset by environmental pollution, traffic congestion, and housing shortages. It is easy to describe Amsterdam, which is more than 700 years old, as a living museum of a bygone age and to praise the eternal beauty of the centuries-old canals, the ancient patrician houses, and the atmosphere of freedom and tolerance, but the modern city is still working out solutions to the pressing urban problems that confront it.",
    "cover_image": "https://cdn.britannica.com/28/94528-050-ADA1C0CE/Amsterdam.jpg"
  },
  {
    "id": 143446,
    "name": "Lisbon",
    "state_id": 4859,
    "state_code": "09",
    "state_name": "Guarda",
    "country_id": 177,
    "country_code": "PT",
    "country_name": "Portugal",
    "latitude": "38.71666667",
    "longitude": "-9.16666667",
    "wikiDataId": "Q597",
    "about": "Lisbon, Portuguese Lisboa, city, port, capital of Portugal, and the centre of the Lisbon metropolitan area. Located in western Portugal on the estuary of the Tagus (Tejo) River, it is the westernmost capital city in continental Europe and serves as the country’s chief port, largest city, and commercial, political, and tourist centre. The city’s name is a modification of the ancient Olisipo (Ulyssipo), and its founding has been attributed to the legacy of Ulysses (Odysseus), the hero of Homer’s Odyssey; to Elisha, purported to have been a grandson of the Hebrew patriarch Abraham; and, more credibly, to Phoenician colonists. Lisbon owes its historical prominence to its natural harbour, one of the most beautiful in the world. Area city, 33 square miles (85 square km). Pop. (2011) city, 547,733; metro. area, 2,821,876; (2021) city, 544,851; metro. area, 2,871,133.",
    "cover_image": "https://cdn.britannica.com/94/92894-050-0A18B738/Dom-Pedro-IV-Square-Rossio-Port-Lisbon.jpg",
    "images": [
      "https://lp-cms-production.imgix.net/2019-06/54989636.jpg",
      "https://cdn.britannica.com/88/124588-050-3E59FF15/Lisbon.jpg",
      "https://static.businessinsider.com/image/5cf91e4c11e2053d9a537464.jpg",
      "https://www.earthsattractions.com/wp-content/uploads/2017/09/lisbon.jpg"
    ]
  },
  {
    "id": 89425,
    "name": "Porto",
    "state_id": 2243,
    "state_code": "13",
    "state_name": "Porto",
    "country_id": 177,
    "country_code": "PT",
    "country_name": "Portugal",
    "latitude": "41.14961000",
    "longitude": "-8.61099000",
    "wikiDataId": "Q33707919",
    "about": "Porto, Portuguese Oporto, city and port, northern Portugal. The city lies along the Douro River, 2 miles (3 km) from the river’s mouth on the Atlantic Ocean and 175 miles (280 km) north of Lisbon. World-famous for its port wine, Porto is Portugal’s second largest city and is the commercial and industrial centre for the zone north of the Mondego River. The historic centre of Porto was designated a UNESCO World Heritage site in 1996. Pop. (2001) city, 263,131; metro. area, 1,647,469; (2011) city, 237,591; metro. area, 1,672,670. Porto was called Portus Cale in Roman times and was earlier a flourishing settlement on the Douro’s south bank; the nomadic Alani tribe later founded the city of Castrum Novum on the north bank. The Visigoths took possession of the site about 540 CE but yielded in 716 to the Moors. In 997 Christian forces recaptured Porto, which for a time became the capital of the counts of Portucalense (northern Portugal) during Moorish rule in the southern part of the kingdom. The Moors again held the city briefly, but in 1092 it was brought finally under Christian domination. In the 14th century the city became an important port, and Prince Henry the Navigator was born there in 1394. During the Peninsular War, British forces under Arthur Wellesley (later the duke of Wellington) there crossed the Douro, routed the French, and captured the city on May 12, 1809. The present-day city lies chiefly on the Douro’s north (right) bank, sprawling outward from the older riverside district known as the Ribeira. The red-tiled warehouses of the town of Vila Nova de Gaia, where vast quantities of port wine are blended and stored, are on the south bank of the Douro; other suburbs include Matosinhos, Leça da Palmeira, and Aguas Santas to the north and Gondomar and Oliveira do Douro to the southeast. The region’s narrow coastal plain quickly rises eastward to an inland undulating plateau. A mild, moist climate and generally fertile soils have encouraged intensive farming in the region, including winter and summer cereals, vegetables, and tree crops (cork oak and olive). Timber and its associated industries and the production of vinho verde (an effervescent wine) are also important.",
    "cover_image": "https://cdn.britannica.com/99/178099-050-87664A53/Dom-Luis-I-Bridge-Douro-River-Portugal.jpg",
    "images": [
      "https://cdn.britannica.com/98/178098-050-9E076C05/dwellings-district-Ribeira-Portugal-Porto.jpg",
      "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/11/48/e8/4a/view-from-room.jpg?w=1200",
      "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/d3/b1/69/photo0jpg.jpg?w=1200",
      "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/6b/29/20/quartier-ribeira.jpg?w=1200"
    ]
  },
  {
    "id": 59582,
    "name": "Rome",
    "state_id": 1678,
    "state_code": "62",
    "state_name": "Lazio",
    "country_id": 107,
    "country_code": "IT",
    "country_name": "Italy",
    "latitude": "41.89193000",
    "longitude": "12.51133000",
    "wikiDataId": "Q3940648",
    "about": "Rome, Italian Roma, historic city and capital of Roma provincia (province), of Lazio regione (region), and of the country of Italy. Rome is located in the central portion of the Italian peninsula, on the Tiber River about 15 miles (24 km) inland from the Tyrrhenian Sea. Once the capital of an ancient republic and empire whose armies and polity defined the Western world in antiquity and left seemingly indelible imprints thereafter, the spiritual and physical seat of the Roman Catholic Church, and the site of major pinnacles of artistic and intellectual achievement, Rome is the Eternal City, remaining today a political capital, a religious centre, and a memorial to the creative imagination of the past. Area city, 496 square miles (1,285 square km); province, 2,066 square miles (5,352 square km). Pop. (2011) city, 2,617,175; province, 3,997,465; (2022 est.) city, 2,761,632; province, 4,222,631.",
    "cover_image": "https://cdn.britannica.com/46/154246-050-7C72E12F/view-Rome.jpg"
  },
  {
    "id": 44856,
    "name": "Paris",
    "state_id": 4796,
    "state_code": "IDF",
    "state_name": "Île-de-France",
    "country_id": 75,
    "country_code": "FR",
    "country_name": "France",
    "latitude": "48.85340000",
    "longitude": "2.34860000",
    "wikiDataId": "Q90",
    "about": "Paris, city and capital of France, situated in the north-central part of the country. People were living on the site of the present-day city, located along the Seine River some 233 miles (375 km) upstream from the river’s mouth on the English Channel (La Manche), by about 7600 BCE. The modern city has spread from the island (the Île de la Cité) and far beyond both banks of the Seine. Paris occupies a central position in the rich agricultural region known as the Paris Basin, and it constitutes one of eight départements of the Île-de-France administrative region. It is by far the country’s most important centre of commerce and culture. Area city, 41 square miles (105 square km); metropolitan area, 890 square miles (2,300 square km). Pop. (2020 est.) city, 2,145,906; (2020 est.) urban agglomeration, 10,858,874.",
    "cover_image": "https://cdn.britannica.com/36/135436-050-ED1D0FCE/skyline-Eiffel-Tower-France-Paris.jpg"
  },
  {
    "id": 43678,
    "name": "Lyon",
    "state_id": 4798,
    "state_code": "ARA",
    "state_name": "Auvergne-Rhône-Alpes",
    "country_id": 75,
    "country_code": "FR",
    "country_name": "France",
    "latitude": "45.74846000",
    "longitude": "4.84671000",
    "wikiDataId": "Q456",
    "about": "Lyon, also spelled Lyons, capital of both the Rhône département and the Auvergne-Rhône-Alpes région, east-central France, set on a hilly site at the confluence of the Rhône and Saône rivers. It is the third largest city in France, after Paris and Marseille. A Roman military colony called Lugdunum was founded there in 43 BCE, and it subsequently became the capital of the Gauls. Lyon reached its peak of classical development in the 2nd century CE, during which time Christianity was introduced. In 177 the Christian community was persecuted by the Roman emperor Marcus Aurelius, and in 197 Lucius Septimius Severus decimated Lyon. In 1032 Lyon was incorporated into the Holy Roman Empire, but the real power lay with the city’s archbishops, whose influence caused important ecumenical councils to be held there in 1245 and again in 1274. Lyon was annexed to the kingdom of France in 1312.",
    "cover_image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Lyon_05_-_%C3%89glise_Saint-Paul_-_PA00117802.JPG/1920px-Lyon_05_-_%C3%89glise_Saint-Paul_-_PA00117802.JPG"
  },
  {
    "id": 32653,
    "name": "Barcelona",
    "state_id": 5102,
    "state_code": "B",
    "state_name": "Barcelona",
    "country_id": 207,
    "country_code": "ES",
    "country_name": "Spain",
    "latitude": "41.38879000",
    "longitude": "2.15899000",
    "wikiDataId": "Q1492",
    "about": "Barcelona, city, seaport, and capital of Barcelona provincia (province) and of Catalonia comunidad autónoma (autonomous community), northeastern Spain, located 90 miles (150 km) south of the French border. It is Spain’s major Mediterranean port and commercial centre and is famed for its individuality, cultural interest, and physical beauty. On his visit to the city in 1862, Hans Christian Andersen remarked that Barcelona was the “Paris of Spain.” The city is indeed a major cultural centre with a remarkable history. It abounds with archives, libraries, museums, and buildings of interest, featuring superb examples of Modernist and Art Nouveau decor and architecture. Since the late 1970s, with the official recognition of the Catalan language and the granting of significant levels of regional self-government, cultural life has been revitalized, bringing with it a new awareness of the depth and variety of Catalan culture. This vitality combines with the striking physical setting of Barcelona—between scenic mountains and the Mediterranean Sea, with a benign climate that fosters street life—and its significance as an economic power and a major port to create a city of infinite variety. Area city, 38 square miles (98 square km); metropolitan area, 1,249 square miles (3,235 square km). Pop. (2011) 1,611,013; (2018 est.) 1,620,343.",
    "cover_image": "https://cdn.britannica.com/05/102605-050-3E411EE7/Barcelona.jpg"
  },
  {
    "id": 50388,
    "name": "London",
    "state_id": 2336,
    "state_code": "ENG",
    "state_name": "England",
    "country_id": 232,
    "country_code": "GB",
    "country_name": "United Kingdom",
    "latitude": "51.50853000",
    "longitude": "-0.12574000",
    "wikiDataId": "Q84",
    "about": "London, city, capital of the United Kingdom. It is among the oldest of the world’s great cities—its history spanning nearly two millennia—and one of the most cosmopolitan. By far Britain’s largest metropolis, it is also the country’s economic, transportation, and cultural centre. London is situated in southeastern England, lying astride the River Thames some 50 miles (80 km) upstream from its estuary on the North Sea. In satellite photographs the metropolis can be seen to sit compactly in a Green Belt of open land, with its principal ring highway (the M25 motorway) threaded around it at a radius of about 20 miles (30 km) from the city centre. The growth of the built-up area was halted by strict town planning controls in the mid-1950s. Its physical limits more or less correspond to the administrative and statistical boundaries separating the metropolitan county of Greater London from the “home counties” of Kent, Surrey, and Berkshire (in clockwise order) to the south of the river and Buckinghamshire, Hertfordshire, and Essex to the north. The historic counties of Kent, Hertfordshire, and Essex extend in area beyond the current administrative counties with the same names to include substantial parts of the metropolitan county of Greater London, which was formed in 1965. Most of Greater London south of the Thames belongs to the historic county of Surrey, while most of Greater London north of the Thames belongs historically to the county of Middlesex. Area Greater London, 607 square miles (1,572 square km). Pop. (2001) Greater London, 7,172,091; (2011 prelim.) Greater London, 8,173,941.",
    "cover_image": "https://cdn.britannica.com/50/136850-050-15D3582B/Houses-Parliament-Big-Ben-London.jpg"
  },
  {
    "id": 99972,
    "name": "Moscow",
    "state_id": 1901,
    "state_code": "MOW",
    "state_name": "Moscow",
    "country_id": 182,
    "country_code": "RU",
    "country_name": "Russia",
    "latitude": "55.75222000",
    "longitude": "37.61556000",
    "wikiDataId": "Q649",
    "about": "Moscow, Russian Moskva, city, capital of Russia, located in the far western part of the country. Since it was first mentioned in the chronicles of 1147, Moscow has played a vital role in Russian history. It became the capital of Muscovy (the Grand Principality of Moscow) in the late 13th century; hence, the people of Moscow are known as Muscovites. Today Moscow is not only the political centre of Russia but also the country’s most populous city and its industrial, cultural, scientific, and educational capital. For more than 600 years Moscow also has been the spiritual centre of the Russian Orthodox Church. The capital of the Union of Soviet Socialist Republics (U.S.S.R.) until the union dissolved in 1991, Moscow attracted world attention as a centre of communist power; indeed, the name of the seat of the former Soviet government and the successor Russian government, the Kremlin (Russian: Kreml), was a synonym for Soviet authority. The dissolution of the U.S.S.R. brought tremendous economic and political change, along with a significant concentration of Russia’s wealth, into Moscow. Area 414 square miles (1,035 square km). Pop. (2010) city, 11,738,547; (2020 est.) city, 12,678,079.",
    "cover_image": "https://cdn.britannica.com/83/84883-050-053834E9/Red-Square-Moscow.jpg",
    "images": [
      "https://cdn.britannica.com/57/144557-050-00422BA6/Moscow.jpg",
      "https://cdn.britannica.com/31/141331-050-437B6696/Kremlin-Moscow-River.jpg",
      "https://cdn.britannica.com/34/95134-050-1E31ADBB/Russian-government-building-Moscow.jpg",
      "https://cdn.britannica.com/11/141111-050-9D76A405/Bolshoi-Theatre-Moscow.jpg"
    ]
  },
  {
    "id": 24053,
    "name": "Berlin",
    "state_id": 3010,
    "state_code": "BE",
    "state_name": "Berlin",
    "country_id": 82,
    "country_code": "DE",
    "country_name": "Germany",
    "latitude": "52.52437000",
    "longitude": "13.41053000",
    "wikiDataId": "Q64",
    "about": "Berlin, capital and chief urban centre of Germany. The city lies at the heart of the North German Plain, athwart an east-west commercial and geographic axis that helped make it the capital of the kingdom of Prussia and then, from 1871, of a unified Germany. Berlin’s former glory ended in 1945, but the city survived the destruction of World War II. It was rebuilt and came to show amazing economic and cultural growth. Experience the transformation of Berlin into a modern and cosmopolitan city after the fall of the Berlin Wall Experience the transformation of Berlin into a modern and cosmopolitan city after the fall of the Berlin WallSee all videos for this article Germany’s division after the war put Berlin entirely within the territory of the German Democratic Republic (GDR, or East Germany). The city itself echoed the national partition—East Berlin being the capital of East Germany and West Berlin a Land (state) of the Federal Republic of Germany (FRG, or West Germany). West Berlin’s isolation was later reinforced by the concrete barrier erected in 1961 and known as the Berlin Wall. Its status as an enclave made Berlin a continuous focus of confrontation between the Eastern and Western powers as well as a symbol of Western lifestyle for 45 years. The fall of the East German communist regime—and the accompanying opening of the wall—in late 1989 unexpectedly raised the prospect for Berlin’s reinstatement as the all-German capital. That status was restored in 1990 under the terms of the unification treaty, and subsequently Berlin was designated a state, one of the 16 constituting Germany. These developments heralded the city’s return to its historic position of prominence in European culture and commerce. Area 344 square miles (891 square km). Pop. (2011) 3,292,365; (2021 est.) 3,677,472.",
    "cover_image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Museumsinsel_Berlin_Juli_2021_1.jpg/1920px-Museumsinsel_Berlin_Juli_2021_1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Berliner_Stadtschloss%2C_September_2022-L1000099.jpg/1920px-Berliner_Stadtschloss%2C_September_2022-L1000099.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/2/24/Gendarmenmarkt_Panorama.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Berliner_Dom_seen_from_James_Simon_Park.jpg/1024px-Berliner_Dom_seen_from_James_Simon_Park.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Berlin_reichstag_west_panorama.jpg/2560px-Berlin_reichstag_west_panorama.jpg"
    ]
  },
  {
    "id": 30620,
    "name": "Copenhagen",
    "state_id": 1530,
    "state_code": "84",
    "state_name": "Capital Region of Denmark",
    "country_id": 59,
    "country_code": "DK",
    "country_name": "Denmark",
    "latitude": "55.67594000",
    "longitude": "12.56553000",
    "wikiDataId": "Q1748",
    "about": "Copenhagen, Danish København, capital and largest city of Denmark. It is located on the islands of Zealand (Sjælland) and Amager, at the southern end of The Sound (Øresund). A small village existed on the site of the present city by the early 10th century. In 1167 Bishop Absalon of Roskilde built a castle on an islet off the coast and fortified the town with ramparts and a moat. In 1445 Copenhagen was made the capital of Denmark and the residence of the royal family. In the civil and religious conflicts of the Protestant Reformation, the town was often sacked. During the late 16th century Copenhagen’s trade began to flourish, and the city itself expanded. Among the new buildings erected were the Børsen (Exchange), the Holmens Church, Trinitatis Church, with the adjacent famous Round Tower, and the castle of Rosenborg (now the museum of the royal family). During the wars with Sweden (1658–60) Copenhagen was besieged for two years. Fires in 1728 and 1795 destroyed many houses and buildings, and in 1807 the city was bombarded by the British. The ramparts were pulled down in 1856. Since then the city has expanded still further and incorporated many of the adjacent districts. The heart of the city is the Rådhuspladsen (“Town Hall Square”). From the square, an old crooked shopping street leads northeast to the former centre of the city, Kongens Nytorv (“King’s New Square”), laid out in the 17th century. Buildings there include the Thott Palace (now the French Embassy) and the Charlottenborg Palace (now the Royal Academy of Fine Arts), both of the 17th century, and the Royal Theatre, built in 1874.",
    "cover_image": "https://cdn.britannica.com/85/117385-050-9D7D5132/Copenhagen-Den.jpg",
    "images": [
      "https://cdn.britannica.com/47/83447-050-42342CB1/Nyhavn-Canal-Copenhagen.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/1/1a/Copenhagen%2C_view_from_Rundet%C3%A5rn%2C_20220617_1007_6725.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/f/fd/Copenhagen_-_view_from_Christiansborg_castle.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/7/7f/K%C3%B8benhavns_R%C3%A5dhus_by_night_-_Copenhagen_City_Hall_by_night_%28april_2022%29_1.jpg"
    ]
  },
  {
    "id": 103758,
    "name": "Stockholm",
    "state_id": 1551,
    "state_code": "AB",
    "state_name": "Stockholm County",
    "country_id": 213,
    "country_code": "SE",
    "country_name": "Sweden",
    "latitude": "59.33258000",
    "longitude": "18.06490000",
    "wikiDataId": "Q1754"
  },
  {
    "id": 103517,
    "name": "Malmö",
    "state_id": 1541,
    "state_code": "M",
    "state_name": "Skåne County",
    "country_id": 213,
    "country_code": "SE",
    "country_name": "Sweden",
    "latitude": "55.60587000",
    "longitude": "13.00073000",
    "wikiDataId": "Q2211"
  },
  {
    "id": 18809,
    "name": "Zürich",
    "state_id": 1656,
    "state_code": "ZH",
    "state_name": "Zürich",
    "country_id": 214,
    "country_code": "CH",
    "country_name": "Switzerland",
    "latitude": "47.36667000",
    "longitude": "8.55000000",
    "wikiDataId": "Q22659246"
  },
  {
    "id": 17827,
    "name": "Genève",
    "state_id": 1647,
    "state_code": "GE",
    "state_name": "Geneva",
    "country_id": 214,
    "country_code": "CH",
    "country_name": "Switzerland",
    "latitude": "46.20222000",
    "longitude": "6.14569000",
    "wikiDataId": "Q69290"
  },
  {
    "id": 149129,
    "name": "Basel",
    "state_id": 4957,
    "state_code": "BS",
    "state_name": "Basel-Stadt",
    "country_id": 214,
    "country_code": "CH",
    "country_name": "Switzerland",
    "latitude": "47.55472200",
    "longitude": "7.59055600",
    "wikiDataId": "Q78"
  },
  {
    "id": 38770,
    "name": "Helsinki",
    "state_id": 1510,
    "state_code": "18",
    "state_name": "Uusimaa",
    "country_id": 74,
    "country_code": "FI",
    "country_name": "Finland",
    "latitude": "60.16952000",
    "longitude": "24.93545000",
    "wikiDataId": "Q1757",
    "about": "Helsinki, Swedish Helsingfors, capital of Finland. It is the leading seaport and industrial city of the nation. Helsinki lies in the far south of the country, on a peninsula that is fringed by fine natural harbours and that protrudes into the Gulf of Finland. It is the most northerly of continental European capitals. It is often called the “white city of the north” because many of its buildings are constructed of a local light-coloured granite. Helsinki was founded in 1550 by King Gustav I Vasa of Sweden and was intended to compete with the city of Reval (now Tallinn, Estonia), which lies on the southern shore of the Gulf of Finland. Helsinki was originally located at the mouth of the Vantaa River, at a point about 3 mi (4.8 km) north of its present-day location, and was moved down to the latter site in 1640 in order to obtain more open access to the sea. The town was ravaged by a plague in 1710 and burned to the ground in 1713. Its redevelopment was hindered by Russian attacks later in the 18th century, but in 1748 the settlement became more secure when a fortress, called Sveaborg by the Swedes and Suomenlinna by the Finns, was constructed on a group of small islands outside the harbour.",
    "cover_image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Helsingin_ydinkeskustaa_ja_Mannerheimintien_alkup%C3%A4%C3%A4t%C3%A4_Erottajan_paloaseman_tornista_%28cropped%29.jpg/2560px-Helsingin_ydinkeskustaa_ja_Mannerheimintien_alkup%C3%A4%C3%A4t%C3%A4_Erottajan_paloaseman_tornista_%28cropped%29.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Helsinki_July_2013-27a.jpg/1920px-Helsinki_July_2013-27a.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/3/3e/Suomenlinna_%28cropped%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Helsingfors_%283%29.jpg/1920px-Helsingfors_%283%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Aurinkolahden_uimaranta_panoraama.jpg/2560px-Aurinkolahden_uimaranta_panoraama.jpg"
    ]
  },
  {
    "id": 57223,
    "name": "Dublin",
    "state_id": 1073,
    "state_code": "L",
    "state_name": "Leinster",
    "country_id": 105,
    "country_code": "IE",
    "country_name": "Ireland",
    "latitude": "53.33306000",
    "longitude": "-6.24889000",
    "wikiDataId": "Q1761"
  },
  {
    "id": 48458,
    "name": "Belfast",
    "state_id": 2337,
    "state_code": "NYK",
    "state_name": "Northern Ireland",
    "country_id": 232,
    "country_code": "GB",
    "country_name": "United Kingdom",
    "latitude": "54.59682000",
    "longitude": "-5.92541000",
    "wikiDataId": "Q10686"
  },
  {
    "id": 57484,
    "name": "Jerusalem",
    "state_id": 1370,
    "state_code": "JM",
    "state_name": "Jerusalem District",
    "country_id": 106,
    "country_code": "IL",
    "country_name": "Israel",
    "latitude": "31.76904000",
    "longitude": "35.21633000",
    "wikiDataId": "Q1218"
  },
  {
    "id": 4566,
    "name": "Canberra",
    "state_id": 3907,
    "state_code": "ACT",
    "state_name": "Australian Capital Territory",
    "country_id": 14,
    "country_code": "AU",
    "country_name": "Australia",
    "latitude": "-35.28346000",
    "longitude": "149.12807000",
    "wikiDataId": "Q3114"
  },
  {
    "id": 6235,
    "name": "Melbourne",
    "state_id": 3903,
    "state_code": "VIC",
    "state_name": "Victoria",
    "country_id": 14,
    "country_code": "AU",
    "country_name": "Australia",
    "latitude": "-37.81400000",
    "longitude": "144.96332000",
    "wikiDataId": "Q3141"
  },
  {
    "id": 7408,
    "name": "Sydney",
    "state_id": 3909,
    "state_code": "NSW",
    "state_name": "New South Wales",
    "country_id": 14,
    "country_code": "AU",
    "country_name": "Australia",
    "latitude": "-33.86785000",
    "longitude": "151.20732000",
    "wikiDataId": "Q3130"
  },
  {
    "id": 6840,
    "name": "Perth",
    "state_id": 3906,
    "state_code": "WA",
    "state_name": "Western Australia",
    "country_id": 14,
    "country_code": "AU",
    "country_name": "Australia",
    "latitude": "-31.95224000",
    "longitude": "115.86140000",
    "wikiDataId": "Q3183"
  },
  {
    "id": 3681,
    "name": "Vienna",
    "state_id": 2060,
    "state_code": "9",
    "state_name": "Vienna",
    "country_id": 15,
    "country_code": "AT",
    "country_name": "Austria",
    "latitude": "48.20849000",
    "longitude": "16.37208000",
    "wikiDataId": "Q1741"
  },
  {
    "id": 3234,
    "name": "Salzburg",
    "state_id": 2061,
    "state_code": "5",
    "state_name": "Salzburg",
    "country_id": 15,
    "country_code": "AT",
    "country_name": "Austria",
    "latitude": "47.79941000",
    "longitude": "13.04399000",
    "wikiDataId": "Q32220672"
  },
  {
    "id": 22970,
    "name": "Prague",
    "state_id": 4598,
    "state_code": "10",
    "state_name": "Praha, Hlavní město",
    "country_id": 58,
    "country_code": "CZ",
    "country_name": "Czech Republic",
    "latitude": "50.08804000",
    "longitude": "14.42076000",
    "wikiDataId": "Q1085"
  },
  {
    "id": 22904,
    "name": "Ostrava",
    "state_id": 4600,
    "state_code": "80",
    "state_name": "Moravskoslezský kraj",
    "country_id": 58,
    "country_code": "CZ",
    "country_name": "Czech Republic",
    "latitude": "49.83465000",
    "longitude": "18.28204000",
    "wikiDataId": "Q8385"
  },
  {
    "id": 88480,
    "name": "Warsaw",
    "state_id": 1637,
    "state_code": "MZ",
    "state_name": "Masovian Voivodeship",
    "country_id": 176,
    "country_code": "PL",
    "country_name": "Poland",
    "latitude": "52.22977000",
    "longitude": "21.01178000",
    "wikiDataId": "Q270"
  },
  {
    "id": 86763,
    "name": "Kraków",
    "state_id": 1635,
    "state_code": "MA",
    "state_name": "Lesser Poland Voivodeship",
    "country_id": 176,
    "country_code": "PL",
    "country_name": "Poland",
    "latitude": "50.07262000",
    "longitude": "19.93250000",
    "wikiDataId": "Q741667"
  },
  {
    "id": 87774,
    "name": "Poznań",
    "state_id": 1634,
    "state_code": "WP",
    "state_name": "Greater Poland Voivodeship",
    "country_id": 176,
    "country_code": "PL",
    "country_name": "Poland",
    "latitude": "52.40692000",
    "longitude": "16.92993000",
    "wikiDataId": "Q268"
  }
]
